data/fio/RHEL6.6/4k/Read.log
thread-1: (g=0): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
thread-2: (g=1): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
thread-4: (g=2): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
thread-8: (g=3): rw=read, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.9
Starting 15 processes

thread-1: (groupid=0, jobs=1): err= 0: pid=3182: Wed Aug 19 12:46:40 2015
  read : io=4096.0MB, bw=208454KB/s, iops=52113, runt= 20121msec
    clat (usec): min=0, max=60978, avg=18.73, stdev=211.67
     lat (usec): min=0, max=60978, avg=18.79, stdev=211.67
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1032], 99.50th=[ 1384], 99.90th=[ 2384], 99.95th=[ 2384],
     | 99.99th=[ 2416]
    bw (KB  /s): min=185856, max=229968, per=100.00%, avg=208502.48, stdev=7715.27
    lat (usec) : 2=96.12%, 4=1.44%, 10=0.26%, 20=0.62%, 50=0.21%
    lat (usec) : 100=0.16%, 250=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.85%, 4=0.34%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%
  cpu          : usr=3.19%, sys=7.88%, ctx=12611, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1048576/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=3184: Wed Aug 19 12:46:40 2015
  read : io=2048.0MB, bw=141709KB/s, iops=35427, runt= 14799msec
    clat (usec): min=0, max=708292, avg=27.78, stdev=1897.52
     lat (usec): min=0, max=708292, avg=27.83, stdev=1897.52
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   55], 99.50th=[ 2024], 99.90th=[ 2416], 99.95th=[ 2416],
     | 99.99th=[ 6368]
    bw (KB  /s): min=  721, max=209920, per=73.66%, avg=149770.59, stdev=67148.22
    lat (usec) : 2=96.32%, 4=1.16%, 10=0.44%, 20=0.52%, 50=0.44%
    lat (usec) : 100=0.17%, 1000=0.01%
    lat (msec) : 2=0.35%, 4=0.59%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=2.13%, sys=5.20%, ctx=5015, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=3185: Wed Aug 19 12:46:40 2015
  read : io=2048.0MB, bw=101670KB/s, iops=25417, runt= 20627msec
    clat (usec): min=0, max=1044.2K, avg=38.86, stdev=3118.64
     lat (usec): min=0, max=1044.2K, avg=38.93, stdev=3118.64
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1048], 99.50th=[ 1080], 99.90th=[ 1400], 99.95th=[ 1416],
     | 99.99th=[ 3984]
    bw (KB  /s): min=  245, max=209920, per=55.96%, avg=113796.18, stdev=90089.58
    lat (usec) : 2=95.69%, 4=1.78%, 10=0.06%, 20=0.91%, 50=0.01%
    lat (usec) : 100=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=1.54%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 2000=0.01%
  cpu          : usr=1.64%, sys=3.91%, ctx=8196, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=524288/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=3195: Wed Aug 19 12:46:40 2015
  read : io=1024.0MB, bw=134675KB/s, iops=33668, runt=  7786msec
    clat (usec): min=0, max=498466, avg=29.26, stdev=1815.72
     lat (usec): min=0, max=498466, avg=29.31, stdev=1815.72
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   46], 99.50th=[ 2096], 99.90th=[ 2416], 99.95th=[ 2448],
     | 99.99th=[ 6432]
    bw (KB  /s): min=41743, max=202826, per=68.53%, avg=136261.79, stdev=57776.04
    lat (usec) : 2=95.94%, 4=1.47%, 10=0.56%, 20=0.46%, 50=0.68%
    lat (usec) : 100=0.10%
    lat (msec) : 2=0.01%, 4=0.76%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=2.00%, sys=4.77%, ctx=2054, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=3196: Wed Aug 19 12:46:40 2015
  read : io=1024.0MB, bw=49889KB/s, iops=12472, runt= 21018msec
    clat (usec): min=0, max=799416, avg=79.69, stdev=5365.93
     lat (usec): min=0, max=799416, avg=79.75, stdev=5365.93
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1064], 99.50th=[ 1080], 99.90th=[ 1416], 99.95th=[ 1432],
     | 99.99th=[203776]
    bw (KB  /s): min=    5, max=204800, per=27.89%, avg=55459.07, stdev=55153.71
    lat (usec) : 2=95.40%, 4=2.01%, 10=0.06%, 20=0.96%, 50=0.01%
    lat (usec) : 750=0.01%, 1000=0.01%
    lat (msec) : 2=1.53%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  cpu          : usr=0.80%, sys=1.88%, ctx=4102, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=3197: Wed Aug 19 12:46:40 2015
  read : io=1024.0MB, bw=56490KB/s, iops=14122, runt= 18562msec
    clat (usec): min=0, max=1043.6K, avg=70.32, stdev=5349.32
     lat (usec): min=0, max=1043.6K, avg=70.38, stdev=5349.32
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1064], 99.50th=[ 1096], 99.90th=[ 1416], 99.95th=[ 1432],
     | 99.99th=[156672]
    bw (KB  /s): min=  259, max=195584, per=33.80%, avg=67203.00, stdev=59377.46
    lat (usec) : 2=95.39%, 4=2.03%, 10=0.06%, 20=0.95%, 50=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=1.53%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%
  cpu          : usr=1.00%, sys=2.02%, ctx=4101, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=3198: Wed Aug 19 12:46:40 2015
  read : io=1024.0MB, bw=49707KB/s, iops=12426, runt= 21095msec
    clat (usec): min=0, max=1053.5K, avg=79.99, stdev=5562.69
     lat (usec): min=0, max=1053.5K, avg=80.05, stdev=5562.69
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1064], 99.50th=[ 1096], 99.90th=[ 1416], 99.95th=[ 1448],
     | 99.99th=[226304]
    bw (KB  /s): min=  243, max=201728, per=27.89%, avg=55462.44, stdev=52173.05
    lat (usec) : 2=95.37%, 4=2.03%, 10=0.06%, 20=0.97%, 50=0.01%
    lat (usec) : 100=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=1.53%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%
  cpu          : usr=0.78%, sys=1.89%, ctx=4101, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=262144/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3199: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=121701KB/s, iops=30425, runt=  4308msec
    clat (usec): min=0, max=326604, avg=32.41, stdev=1613.55
     lat (usec): min=0, max=326604, avg=32.47, stdev=1613.55
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   46], 99.50th=[ 2096], 99.90th=[ 2448], 99.95th=[ 2448],
     | 99.99th=[38656]
    bw (KB  /s): min= 6449, max=192512, per=42.58%, avg=126449.62, stdev=70522.67
    lat (usec) : 2=95.70%, 4=1.66%, 10=0.56%, 20=0.51%, 50=0.73%
    lat (usec) : 100=0.07%
    lat (msec) : 2=0.01%, 4=0.74%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=1.79%, sys=4.25%, ctx=1010, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3200: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=40243KB/s, iops=10060, runt= 13028msec
    clat (usec): min=0, max=733822, avg=98.96, stdev=6126.15
     lat (usec): min=0, max=733822, avg=99.01, stdev=6126.15
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   53], 99.50th=[ 1064], 99.90th=[ 1416], 99.95th=[ 3600],
     | 99.99th=[337920]
    bw (KB  /s): min=  869, max=364591, per=15.31%, avg=45463.42, stdev=82935.26
    lat (usec) : 2=96.06%, 4=1.81%, 10=0.11%, 20=0.44%, 50=0.12%
    lat (usec) : 100=0.74%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.63%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.51%, sys=1.48%, ctx=951, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3201: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=46512KB/s, iops=11628, runt= 11272msec
    clat (usec): min=0, max=748885, avg=85.56, stdev=5311.29
     lat (usec): min=0, max=748885, avg=85.61, stdev=5311.29
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   54], 99.50th=[ 1064], 99.90th=[ 1416], 99.95th=[ 2040],
     | 99.99th=[321536]
    bw (KB  /s): min=  487, max=212462, per=14.56%, avg=43232.18, stdev=53609.99
    lat (usec) : 2=95.91%, 4=1.96%, 10=0.10%, 20=0.45%, 50=0.08%
    lat (usec) : 100=0.78%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.65%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.66%, sys=1.67%, ctx=970, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3202: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=37126KB/s, iops=9281, runt= 14122msec
    clat (usec): min=0, max=708965, avg=107.31, stdev=6271.85
     lat (usec): min=0, max=708965, avg=107.37, stdev=6271.84
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   53], 99.50th=[ 1064], 99.90th=[ 1416], 99.95th=[16768],
     | 99.99th=[387072]
    bw (KB  /s): min=  951, max=244407, per=8.59%, avg=25522.36, stdev=55182.01
    lat (usec) : 2=95.81%, 4=2.09%, 10=0.11%, 20=0.42%, 50=0.18%
    lat (usec) : 100=0.68%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.61%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.57%, sys=1.29%, ctx=976, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3203: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=46242KB/s, iops=11560, runt= 11338msec
    clat (usec): min=0, max=1037.2K, avg=86.06, stdev=5939.96
     lat (usec): min=0, max=1037.2K, avg=86.12, stdev=5939.96
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[   53], 99.50th=[ 1064], 99.90th=[ 1416], 99.95th=[ 1912],
     | 99.99th=[272384]
    bw (KB  /s): min=  351, max=125968, per=9.43%, avg=28014.88, stdev=36337.10
    lat (usec) : 2=96.04%, 4=1.81%, 10=0.12%, 20=0.47%, 50=0.09%
    lat (usec) : 100=0.77%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.65%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 2000=0.01%
  cpu          : usr=0.64%, sys=1.66%, ctx=969, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3204: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=37444KB/s, iops=9360, runt= 14002msec
    clat (usec): min=0, max=691865, avg=106.37, stdev=5708.03
     lat (usec): min=0, max=691865, avg=106.43, stdev=5708.03
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1048], 99.50th=[ 1080], 99.90th=[ 1464], 99.95th=[18816],
     | 99.99th=[337920]
    bw (KB  /s): min= 1256, max=189572, per=10.14%, avg=30127.43, stdev=44783.67
    lat (usec) : 2=95.33%, 4=2.37%, 10=0.16%, 20=0.57%, 50=0.08%
    lat (usec) : 100=0.42%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.96%, 4=0.02%, 10=0.02%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.01%, 750=0.01%
  cpu          : usr=0.67%, sys=1.29%, ctx=1457, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3205: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=39931KB/s, iops=9982, runt= 13130msec
    clat (usec): min=0, max=728490, avg=99.72, stdev=6017.24
     lat (usec): min=0, max=728490, avg=99.78, stdev=6017.24
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1048], 99.50th=[ 1080], 99.90th=[ 1416], 99.95th=[ 3792],
     | 99.99th=[333824]
    bw (KB  /s): min=  222, max=113350, per=12.25%, avg=36389.16, stdev=41102.53
    lat (usec) : 2=95.68%, 4=2.02%, 10=0.09%, 20=0.64%, 50=0.07%
    lat (usec) : 100=0.42%, 250=0.01%, 500=0.01%, 1000=0.01%
    lat (msec) : 2=1.00%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.58%, sys=1.47%, ctx=1440, majf=0, minf=36
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=3206: Wed Aug 19 12:46:40 2015
  read : io=524288KB, bw=37732KB/s, iops=9433, runt= 13895msec
    clat (usec): min=0, max=743751, avg=105.55, stdev=6213.60
     lat (usec): min=0, max=743751, avg=105.60, stdev=6213.60
    clat percentiles (usec):
     |  1.00th=[    0],  5.00th=[    0], 10.00th=[    0], 20.00th=[    0],
     | 30.00th=[    0], 40.00th=[    1], 50.00th=[    1], 60.00th=[    1],
     | 70.00th=[    1], 80.00th=[    1], 90.00th=[    1], 95.00th=[    1],
     | 99.00th=[ 1048], 99.50th=[ 1064], 99.90th=[ 1416], 99.95th=[13632],
     | 99.99th=[329728]
    bw (KB  /s): min=  693, max=300544, per=14.45%, avg=42928.42, stdev=70447.52
    lat (usec) : 2=95.57%, 4=2.09%, 10=0.11%, 20=0.67%, 50=0.05%
    lat (usec) : 100=0.45%, 250=0.01%, 500=0.01%, 1000=0.01%
    lat (msec) : 2=0.99%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.02%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=0.62%, sys=1.32%, ctx=1442, majf=0, minf=37
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=131072/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: io=4096.0MB, aggrb=208454KB/s, minb=208454KB/s, maxb=208454KB/s, mint=20121msec, maxt=20121msec

Run status group 1 (all jobs):
   READ: io=4096.0MB, aggrb=203340KB/s, minb=101670KB/s, maxb=141709KB/s, mint=14799msec, maxt=20627msec

Run status group 2 (all jobs):
   READ: io=4096.0MB, aggrb=198829KB/s, minb=49707KB/s, maxb=134674KB/s, mint=7786msec, maxt=21095msec

Run status group 3 (all jobs):
   READ: io=4096.0MB, aggrb=297004KB/s, minb=37125KB/s, maxb=121701KB/s, mint=4308msec, maxt=14122msec

Disk stats (read/write):
  sdb: ios=64508/10, merge=0/5, ticks=417490/0, in_queue=417627, util=98.54%